# IsUnit Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
UnitUtils..::..IsUnit Method
UnitUtils Class See Also
---
Checks whether a ForgeTypeId identifies a unit.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2014
# Syntax
C#
---
```text
public static bool IsUnit(
	ForgeTypeId unitTypeId
)
```

Visual Basic
---
```text
Public Shared Function IsUnit ( _
	unitTypeId As ForgeTypeId _
) As Boolean
```

Visual C++
---
```text
public:
static bool IsUnit(
	ForgeTypeId^ unitTypeId
)
```

# ### Parameters
unitTypeId
    Type: Autodesk.Revit.DB..::..ForgeTypeId The identifier to check.
# ### Return Value
True if the ForgeTypeId identifies a unit, false otherwise.
# Remarks
The UnitTypeId class offers unit identifiers.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | A non-optional argument was null |

# See Also
UnitUtils Class
Autodesk.Revit.DB Namespace